[
  {
    "season": "2017-2018",
    "titlePro": "Quatre de cinc títols amb la Lliga Europea com a cirereta",
    "titleBases": "Molt bona temporada dels filials i mala de la base",
    "contentPro": "Després de quatre temporades amb Ricard Muñoz al capdavant de l’equip, la temporada 2017/2018 l’entrenador barceloní va decidir donar un pas al costat deixant la banqueta del Barça i el seu lloc el va ocupar Edu Castro, que fins aleshores havia estat el seu segon. El tècnic nascut a Vigo i crescut a l’Hospitalet de Llobregat, amb àmplia experiència als equips de base del club, es va fer càrrec d’una plantilla amb poc canvis, a la que va arribar Ignacio Alabart, recuperat després de dues temporades cedit al CP Voltregà, i en la que Edu Lamas, que va tornar al Liceo de la Corunya, va ser l’única baixa. El balanç final de la temporada, amb quatre títols sobre cinc possibles, va ser brillant, però el primer, el de la Lliga Catalana, es va escapar el 23 de setembre de 2017 al Pavelló de les Comes d’Igualada, on el Noia Freixenet, posteriorment subcampió en perdre la final contra el Reus Deportiu, va eliminar a l’equip blaugrana a les semifinals (2-4) després d’obtenir un ple de victòries a la fase de grups i als quarts de final.",
    "contentBases": "La bona temporada del primer equip va tenir continuïtat en la dels dos filials i els veterans, ja que el Barça B de Nacional Catalana va assolir l’ascens a l’OK Lliga Plata, el Barça C de Primera Catalana va acabar tercer al seu grup i per normativa no va poder jugar les eliminatòries d’ascens al ja tenir el club un equip a la categoria superior i els veterans van guanyar dos títols. L’equip sènior de Nacional Catalana, dirigit per Ivan Sanz, va anar de menys a més, ja que després d’acabar quart al seu grup de la primera fase, va entrar com a vuitè al grup dels millors a la segona i va remuntar fins acabar quart i classificar-se pels play-off d’ascens a l’OK Lliga Plata, categoria que havia perdut la temporada anterior."
  },
  {
    "season": "2018-2019",
    "titlePro": "Repòquer de títols amb una històrica OK Lliga sense perdre cap partit ",
    "titleBases": "Ascens del Barça C i títols catalans pel Barça B, l’Infantil i els veterans",
    "contentPro": "",
    "contentBases": ""
  },
  {
    "season": "2019-2020",
    "titlePro": "Rècord de victòries a l’OK Lliga del coronavirus en una temporada inacabada",
    "titleBases": "Paràlisi total dels filials, els equips base i els veterans",
    "contentPro": "",
    "contentBases": ""
  },
  {
    "season": "2020-2021",
    "titlePro": "Un triplet de títols amb decepció majúscula a la Lliga Europea",
    "titleBases": "Els dos filials tornen a brillar i l’Infantil es proclama campió d’Espanya",
    "contentPro": "",
    "contentBases": ""
  },
  {
    "season": "2021-2022",
    "titlePro": "Lliga Catalana i Copa del Rei, pobre collita de títols en l’adeu d’Egurrola",
    "titleBases": "Segueix la bona ratxa dels filials i l’Aleví guanya l’únic títol de la base",
    "contentPro": "",
    "contentBases": ""
  },
  {
    "season": "2022-2023",
    "titlePro": "Triplet de títols amb la Supercopa d’Espanya, la Copa del Rei i l’OK Lliga",
    "contentPro": "Amb les conegudes baixes d’Aitor Egurrola, definitivament retirat, i de Nil Roca, que va marxar al Benfica, i la doble arribada dels germans Carles i Marc Grau, procedents del Deportivo Liceo, la temporada 2022/2023 el Barça va conquerir un triplet de títols amb la Supercopa d’Espanya, la Copa del Rei i l’OK Lliga. El primer títol del curs, aquesta vegada, no va ser la Lliga Catalana, ja que el Barça no hi va participar perquè l'organització dels World Skate Games el mes de novembre a San Juan (Argentina) va obligar a avançar l’inici de les dues màximes competicions estatals i la Lliga Catalana es va disputar entre mitjans d’octubre i mitjans de novembre, durant l’aturada de l’OK Lliga i l’OK Lliga Plata. A manca de la Lliga Catalana, que el Barça s’havia adjudicat en les quatre darreres edicions, el primer títol de la temporada va arribar el 3 de setembre a la Supercopa d’Espanya que es va celebrar a Olot, on els homes d’Edu Castro, que a les semifinals havien derrotat per 6-3 al Noia Freixenet, es van imposar a la final al Reus Deportiu Virginias per 4-0 en una gran actuació coral de tot l’equip. A l’OK Lliga, el Barça va arribar a l’aturada del mes d’octubre com a líder en solitari amb un ple de sis victòries, camí d’una altra actuació memorable a la fase regular, que va completar sense perdre cap partit i només cedint dos empats, a la 12a jornada a la pista del Recam Làser Caldes (5-5) i a la 22a a la del PAS Alcoi (3-3). El 14 de febrer de 2023 el Barça també va ser protagonista a la Gala del Patinatge organitzada per la Federació Catalana de Patinatge, que degut a la pandèmia no s’havia pogut celebrar el 2021 i el 2022, i en la que Pau Bargalló va ser guardonat com a millor esportista masculí de 2021, mentre que Aitor Egurrola va rebre un reconeixement per la seva trajectòria i retirada, igual que la Federació Espanyola havia fet a la seva Gala celebrada uns dies abans. El segon títol de la temporada va ser el de la Copa Rei, que es va celebrar entre el 2 i el 5 de març a Calafell i que el Barça es va adjudicar per 25a vegada al derrotar en la final al Deportivo Liceo, revalidant així la corona que havia assolit el curs anterior. La victòria per 4-2, amb Sergi Fernández com a MVP, li va donar l’oportunitat a Sergi Panadero, que no va poder jugar la Supercopa per lesió, d’aixecar el seu primer trofeu com a capità, càrrec en el que havia substituït a Aitor Egurrola. Als quarts de final havia guanyat per 5-2 a l’Igualada Rigat remuntant l’1-2 del descans i a les semifinals s’havia imposat per 1-0 al Reus Deportiu Virginias amb un solitari gol de Pau Bargalló. Però a la reconvertida Lliga Europea de Campions, de nou sota el control i organització del WSE-RH, el Barça, després d’haver acabat primer del grup C a la lligueta prèvia per davant del Valongo portuguès i el Forte dei Marmi i l’Amatori Lodi italians, es va quedar sense premi tot i arribar a la Final a Vuit celebrada del 4 al 7 de maig a Viana do Castelo, on als quarts de final va vèncer per 5-3 al Barcelos i a les semifinals va perdre per 4-3 contra el Porto, que sempre va anar per davant en el marcador. Pocs dies després, el 14 maig, despès del primer partit de quarts de final del play-off pel títol de l’OK Lliga en el que el Barça va golejar per 11-1 al PAS Alcoi al Palau Blaugrana, va tenir lloc l’acte de retirada del dorsal número 1 d’Aitor Egurrola. En un acte molt emotiu conduit per Aleix Santacana, qui durant molts anys va ser la veu del Palau, Egurrola va entrar a la pista mentre excompanys de vestidor i de l’actual primer equip li feien un passadís d’honor. El porter de Castelldefels va fer un repàs de la seva trajectòria acompanyat de la seva família i al videomarcador van aparèixer els testimonis de Carlos Figueroa, el tècnic que el va fer debutar al primer equip; de Carlitos López, l’autor del primer gol que va encaixar a l’OK Lliga i també excompany al Barça entre el 2004 i el 2011; i de Carles Folguera, amb qui va compartir porteria entre el 1995 i el 2003. Els 78 trofeus obtinguts durant la seva llarga trajectòria amb el Barça també van formar part de l’acte, introduïts per joves jugadors del planter blaugrana i els del primer equip, formant una imatge espectacular sobre el parquet del Palau. Finalment Beto Borregán, l’únic jugador d’hoquei que fins a aquells moments tenia la seva samarreta penjada al Palau, va entregar a Egurrola un estic dissenyat per a l’ocasió amb el que la llegenda blaugrana va retirar la lona que ocultava el dorsal número 1 abans de fer l’última volta d’honor davant de la seva afició. La temporada va acabar de manera brillant el 17 de juny a la Corunya amb el 33è títol de l’OK Lliga, que el Barça va recuperar sense perdre cap dels 34 partits que va jugar en aquesta competició: els 26 de la fase regular, en la que només va cedir dos empats, i els 8 del play-off contra el PAS Alcoi (11-1 al Palau Blaugrana i 3-4 a la pista de l’equip alacantí), el Noia Freixenet (5-3 els dos primers a casa i 2-4 a la pròrroga el tercer a Sant Sadurní d’Anoia) i el Deportivo Liceo (5-1 i 4-1 al Palau i x-x el decisiu a Riazor). Una ratxa que, sumats els sis partits des de l’última derrota que el 5 de març de 2022 havia encaixat al mateix pavelló de Riazor contra l’equip gallec, va elevar a 40 els encontres consecutius sense perdre a l’OK Lliga.",
    "titleBases": "Gran èxit de les categories formatives amb tres campionats d’Espanya",
    "contentBases": "La bona temporada del primer equip la van completar els equips filials i de base del club blaugrana, que després d’uns anys amb pocs èxits a l’hoquei formatiu van brillar especialment el curs 2022/2023, en el que tant el Barça Atlètic, nova denominació del Barça B, com el Barça C van assolir molt bones classificacions a l’OK Lliga Plata i la Nacional Catalana, l’Infantil i el Juvenil van fer un triplet de títols i el Júnior va assolir el títol estatal i el subcampionat de Catalunya. El Barça Atlètic, sota la batuta de Raül Castillo, no va participar a la Lliga Catalana Plata per la celebració dels World Skate Games i va acabar quart al Grup Nord de l’OK Lliga Plata, la seva millor classificació des del seu retorn a la segona categoria estatal, essent a més l’equip menys golejat. I el Barça C de Dani Moreno va acabar cinquè a la Nacional Catalana després de ser sisè del Grup B a la primera fase, quart del Grup 2 a la segona i superar la repesca a doble partit contra el CP Vilanova per entrar als play-off pel títol, en els que va caure per dues victòries a una contra el Reus Deportiu als quarts de final. Finalment, en les eliminatòries del 5è al 8è lloc, va tancar la temporada amb dues victòries sobre el CP Manlleu i dues més sobre el PHC Sant Cugat que li van donar el cinquè lloc final. L’Infantil de David Càceres va signar una temporada per emmarcar que va començar guanyant  l’Eurockey Cup U15, el Campionat d’Europa oficiós de la categoria, amb una victòria per 3-2 a la final sobre el SL Benfica a Lloret de Mar, i després va guanyar el Campionat de Catalunya a Lleida superant per 4-1 al CH Vila-seca a Lleida i més tard el Campionat d’Espanya a Mieres derrotant per 6-2 al mateix rival. El Juvenil de Dani Moreno també va fer un doblet de títols als Campionats de Catalunya i d’Espanya superant al Noia Freixenet a les dues finals (4-2 a Cambrils i 4-1 a Gandia) que va completar amb la seva victòria per 4-3 sobre el mateix rival a la Minicopa paral·lela a la Copa del Rei disputada a Calafell. I el Júnior de Raül Castillo va ser subcampió de Catalunya a Lleida al perdre la final per faltes directes contra l’Igualada HC i després es va proclamar campió d’Espanya a Madrid derrotant per 3-1 en la final al CP Alcobendas, que a les semifinals havia estat el botxí de l’equip igualadí. L’Aleví dirigit també per David Càceres va ser l’únic que no va poder assolir el títol, ja que el CH Caldes ‘A’ li va barrar el pas a la final del Campionat de Catalunya a Cambrils, en el que va acabar tercer al superar per 5-4 al CP Tordera sense opció de poder jugar el d’Espanya. Els veterans, per la seva banda, tot i acabar primers a la fase regular del Grup A de la Lliga Catalana i guanyar per 5-3 al CP Malgrat a les semifinals de la Final a Quatre disputada al Pavelló d’Hoquei de Sentmenat, no van poder assolir el títol de campions després de perdre per 1-5 contra el Noia Freixenet en el partit decisiu."
  }
]
